app/controllers/photos_controller.rb

SELECT * FROM "photos"
---
  def index
    @photos = Photo.all

SELECT * FROM "photos" WHERE ("photos"."id" = 1)
---
  def show
    @photo = Photo.find(params[:id])

SELECT * FROM "photos" WHERE ("photos"."id" = 1)
---
  def edit
    @photo = Photo.find(params[:id])

INSERT INTO "photos" ("image_file_size", "updated_at", "image_content_type", "image_remote_url", "is_avatar", "user_id", "image_updated_at", "created_at", "image_file_name") VALUES(2305, '2010-05-03 09:49:36', 'image/gif', NULL, 'f', 1, '2010-05-03 09:49:31', '2010-05-03 09:49:36', 'dd.gif')
---
  def create
    @photo = Photo.new(params[:photo])

    respond_to do |format|
      if @photo.save

SELECT * FROM "photos" WHERE ("photos"."id" = 1)
UPDATE "photos" SET "image_content_type" = 'image/jpeg', "image_file_name" = 'no.jpg', "image_file_size" = 105919, "image_updated_at" = '2010-05-03 10:38:18', "updated_at" = '2010-05-03 10:38:21' WHERE "id" = 1
---
  def update
  @photo = Photo.find(params[:id])
  if @photo.update_attributes(params[:photo])

SELECT * FROM "photos" WHERE ("photos"."id" = 3)
DELETE FROM "photos" WHERE "id" = 3
---
  def destroy
    @photo = Photo.find(params[:id])
    @photo.destroy