app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])

    success = @user && @user.save
---
INSERT INTO "users" ("name", "salt", "updated_at", "crypted_password", "remember_token_expires_at", "remember_token", "login", "email", "created_at") VALUES('', 'b772c96fe9d71e2f482a0f29f2f59e2a88fad79a', '2010-05-03 09:34:02', '069ae6404c1c9d79575520fa8d0a7c1b69db012a', NULL, NULL, 'firefly', 'yangxiwenhuai@gmail.com', '2010-05-03 09:34:02')